In [20]:
import pandas as pd
import numpy as np

In [21]:
df = pd.read_csv("120-years-olympics.csv")
df2 = pd.read_csv("noc_regions.csv")

In [22]:
df.columns

Index(['ID', 'Name', 'Sex', 'Age', 'Height', 'Weight', 'Team', 'NOC', 'Games',
       'Year', 'Season', 'City', 'Sport', 'Event', 'Medal'],
      dtype='object')

In [23]:
# drop countries 0 medals   ---- DONT DO ----  We need all years to join correctly in Tableau
# df.dropna(subset=['Medal'], inplace=True)

In [24]:
df.drop(['ID', 'Name', 'Sex', 'Age', 'Height', 'Weight', 'Team', 'Games',
        'Season', 'City', 'Sport', 'Event'], axis=1, inplace=True)

In [25]:
df.head()

   NOC  Year Medal
0  CHN  1992   NaN
1  CHN  2012   NaN
2  DEN  1920   NaN
3  DEN  1900  Gold
4  NED  1988   NaN

In [26]:
df2.head()

   NOC       region                 notes
0  AFG  Afghanistan                   NaN
1  AHO      Curacao  Netherlands Antilles
2  ALB      Albania                   NaN
3  ALG      Algeria                   NaN
4  AND      Andorra                   NaN

In [27]:
df2.drop(['notes'], axis=1, inplace=True)

In [28]:
df2.head()

   NOC       region
0  AFG  Afghanistan
1  AHO      Curacao
2  ALB      Albania
3  ALG      Algeria
4  AND      Andorra

In [29]:
# create dictionary for {Abbreviation(NOC) : Country(region)} 
NOC = dict(zip(df2.NOC,df2.region))

In [30]:
# create column for country names
df['country'] = df['NOC'].map(NOC)

In [31]:
df.drop(['NOC'], axis=1, inplace=True)

In [32]:
df.head()

   Year Medal      country
0  1992   NaN        China
1  2012   NaN        China
2  1920   NaN      Denmark
3  1900  Gold      Denmark
4  1988   NaN  Netherlands

In [33]:
countryMatchOlympics = df['country'].unique()

In [101]:
# create list of unique Countries to clean up NFA.ipynb

# pd.Series(countryMatchOlympics).to_csv('countryMatchOlympics.csv', index=False)  ----- already exported

In [40]:
# convert all medal types to 1, and force int32 dtype
df['Medal'].replace(['Gold', 'Bronze', 'Silver'], 1, inplace=True)
df['Medal'].fillna(0, inplace=True)
df['Medal'] = df['Medal'].astype('int32')

In [41]:
df.head()

   Year  Medal      country
0  1992      0        China
1  2012      0        China
2  1920      0      Denmark
3  1900      1      Denmark
4  1988      0  Netherlands

In [42]:
df['Year'] = pd.to_datetime(df['Year'], format='%Y')

In [44]:
df.Year.head()

0   1992-01-01
1   2012-01-01
2   1920-01-01
3   1900-01-01
4   1988-01-01
Name: Year, dtype: datetime64[ns]

In [46]:
df.to_csv("YearMedalCountry.csv", index=False)   # ----- already exported